app/controllers/api/cocktails_controller.rb

SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = 1 LIMIT 1
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."cocktail_id" = 4
---
      def detail
        cocktail = Cocktail.find_by(id: params[:id])
        if cocktail
          render json: {
            drinks: [
              {
                id: cocktail.id,
                name: cocktail.name,
                category: cocktail.category,
                container: cocktail.container,
                instructions: cocktail.instructions,
                image: cocktail.image,
                ingredients: cocktail.ingredients.map do |ingredient|
                  {
                    name: ingredient.name,
                    measurement: ingredient.measurement
                  }
                end
              }
            ]